[
  {
    'folders': [],
    'updated': '2017-01-27T21:59:02Z',
    'uid': 'hkmlmsmpt3iex',
    'created': '2017-01-27T21:59:02Z',
    'type': 'feedback',
    'id': 'iygcp73jr546g',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>To a new student in a \xa0CS course, this response is invaluable. Your book is an excellent place to start, but the plethora of coding knowledge that exists on the internet today can greatly aid in your ability to understand how a coding language works. Additionally, messing with the language in your free time by looking up simple programs also further enhances your understanding of the language, and will aid you on homework, labs, exams, etc.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-27T22:03:12Z',
    'uid': 'ipdyqd7b3rv706',
    'created': '2017-01-27T22:03:12Z',
    'type': 'feedback',
    'id': 'iygcujd46v97az',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>StackOverflow is a good resource, but you also need to be careful in how you use it. It can be tempting to look at code posted there and say &#34;oh, that makes sense. I know exactly what&#39;s going on&#34;, then get to a lab or the next assignment and not be able to figure out the code. Part of learning Python programming is being able to look at the problem and write code to solve it, which requires original thought. So, StackOverflow is a good resource but struggling through code on your own is irreplaceable.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T14:33:00Z',
    'uid': 'hz5sohg9ogy5en',
    'created': '2017-01-29T14:33:00Z',
    'type': 'feedback',
    'id': 'iyirnaqmzn047d',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I really could not agree more. Our textbook is very easy to read, cheap and has a lot of examples present. As far as simple programs go there is a website called programmiz and it has a lot of examples of easy programs that you can practice. \xa0It even has an example of what the program\xa0code could look like, so that way students who have no clue how to even start a program can get a basic idea and work through some example programs.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T18:25:02Z',
    'uid': 'iy855s6o877556',
    'created': '2017-01-29T18:25:02Z',
    'type': 'feedback',
    'id': 'iyizxosoiu935h',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I took a python course last year and DePaul, but instead of playing around with Python and figuring out how everything works, I found myself looking up how to do many of the problems on Stack Overflow, and as a result I did poorly in the class. Just like having the solutions to a practice test when you&#39;re studying, you can&#39;t look at the solution and then think you know how to do the question. If you&#39;re truly stumped on a question, you should go to TA office hours and work it out with them before you go looking up how to do it on Stack Overflow. However, it can be a good tool to use if you missed office hours and need to figure out a solution.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T18:25:51Z',
    'uid': 'iy855s6o877556',
    'created': '2017-01-29T18:25:51Z',
    'type': 'feedback',
    'id': 'iyizyqbll926np',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Michael Lipinski ^</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T18:30:24Z',
    'uid': 'ieex4tbxert1l7',
    'created': '2017-01-29T18:30:24Z',
    'type': 'feedback',
    'id': 'iyj04le0yt4799',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Both of StackOverflow and textbooks are pretty useful, but be sure to focus on the answers that have a &#34;check mark&#34;, especially for the beginners. Some of the answers do not run well and some of them are just too complicated. So it is good to focus on the correct ones and to figure out the solution for our own homework questions. Also, the textbook is a more direct tool to preview before lab and lecture.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T03:40:25Z',
    'uid': 'hzbda39stur7la',
    'created': '2017-01-30T03:40:25Z',
    'type': 'feedback',
    'id': 'iyjjrx7xkzm222',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree that looking up solutions can sometimes be the best help when trying to find a specific solution. However, this method often takes away the learning process that is especially important to students who have never coded before. If they do not specifically understand why one line works the way it does, they might try something similar in a situation where it is not applicable. Instead of reading code to understand it, I have found extra practice examples are especially valuable. There are many apps which can let you practice Python on your phone. During any free time, such as a bus ride or walk home, you could practice some of the concepts you may not understand. The app that I found to be most helpful is called &#34;Lrn,&#34; for Python and other coding languages.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:48:43Z',
    'uid': 'iy855sz3f3t55x',
    'created': '2017-01-30T17:48:43Z',
    'type': 'feedback',
    'id': 'iyke2trd89i1ev',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Whenever I get stuck on how to do something, I will first use the textbook, and then I will go to StackOverflow. I have never coded before, so this is completely new to me. I will sometimes go on Python and go over homework problems and lab exercises to make sure I understand how and why it works. Working on assignments days ahead of the due date will allow you to not be so stressed if you can&#39;t get the code to work.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T23:09:09Z',
    'uid': 'iy50z05lSQQ',
    'created': '2017-01-30T23:09:09Z',
    'type': 'feedback',
    'id': 'iykpiwzxcc05gi',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I&#39;ve never heard of StackOverflow, thanks for the info! I&#39;ve been looking for a reliable site to ask questions that the textbook doesn&#39;t answer. It&#39;s hard to find a consistent answers online most of the time.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T19:06:35Z',
    'uid': 'ijelfdjoxbm47o',
    'created': '2017-01-31T19:06:35Z',
    'type': 'feedback',
    'id': 'iylwatlainu4nr',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T05:59:07Z',
    'uid': 'idnhwb7dvsa5m4',
    'created': '2017-02-01T05:59:07Z',
    'type': 'feedback',
    'id': 'iymjlzcdjvc3zz',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I believe that using online examples serves as a better resource than the book because it enables you to search for specific examples regarding the type of program you are doing.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-27T22:22:55Z',
    'uid': 'idqeexrkzCL',
    'created': '2017-01-27T22:22:55Z',
    'type': 'feedback',
    'id': 'iygdjw3d3k73b8',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I think this is great advice. Writing code at the last minute whether you&#39;re a beginner or experienced can be frustrating. Taking the time to understand the concepts will result in a deeper understanding and will\xa0make it easier to write code in the future.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-27T23:27:15Z',
    'uid': 'h647r91y9px6h0',
    'created': '2017-01-27T23:27:15Z',
    'type': 'feedback',
    'id': 'iygfumpr6a13op',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Also, when you are in a time-crunch and need to finish coding quickly, it can be very tempting to just find a solution online, and by doing so, breaking the academic honesty policy and gaining little to no value since you did not actually &#39;learn&#39; the solution. Starting early is definitely excellent advice.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:50:58Z',
    'uid': 'ijdn7uhkRxi',
    'created': '2017-01-28T20:50:58Z',
    'type': 'feedback',
    'id': 'iyhpphtchbb3a5',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>And finding the solution online is likely to give you a different way to code it. Like using a while loop instead of a for loop.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T19:38:33Z',
    'uid': 'isgscvqrahc1i8',
    'created': '2017-01-30T19:38:33Z',
    'type': 'feedback',
    'id': 'iyki031fxfv3jb',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Alongside knowing to code early, just remember that Python is VERY DIFFERENT from most other coding platforms. Without getting too deep into details, Python programming is not too much the same as other code systems, so knowing general code won&#39;t be what you&#39;ll want to &#34;study&#34; early. One place you can go to get more coding practice on Python specifically is Codeacademy. Here is a url to the link:\xa0<a href="https://www.codecademy.com">https://www.codecademy.com</a>. Hope this helps!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T14:56:28Z',
    'uid': 'ipfxvvp2hft549',
    'created': '2017-01-31T14:56:28Z',
    'type': 'feedback',
    'id': 'iylnd5t9mt842r',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree!\xa0 Starting early is a must.\xa0 Coding is not something that is easily completed at the last minute.\xa0 Sometimes it is best to take a break from coding and come back later with a fresh perspective.\xa0 That is only possible if you start early!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-27T22:18:03Z',
    'uid': 'ixv644u5HqW',
    'created': '2017-01-27T22:18:03Z',
    'type': 'feedback',
    'id': 'iygddngsvtl7kf',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I agree with Elizabeth. It is very important to understand the very basics of the language, otherwise it becomes extremely difficult to even understand the topics covered in the following class. If one is having any issues understanding these, one can immediately approach either the Professor/TA with the doubt or can post it here on Piazza to gain an insightful response from the other students as well as the Professor. Also, one can try writing pseudocodes for the loops, strings, etc. first and then type them out as a program.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T00:54:42Z',
    'uid': 'iy855t0is3j55z',
    'created': '2017-01-31T00:54:42Z',
    'type': 'feedback',
    'id': 'iyktana2ha565u',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with Elizabeth as well. If a person is unfamiliar with the language that python uses it is very difficult to complete the assignments and pre-labs. If an individual is having difficulty with this course, I personally would attend the Professors office hours regularly and go to TA office hours on a weekly basis. Another advice would be to maybe watch videos where people are teaching other students how to use python may be a helpful tool. Practicing how to use python daily will definitely improve homework and lab skills.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T02:28:56Z',
    'uid': 'idnhwhw66nb5rf',
    'created': '2017-01-28T02:28:56Z',
    'type': 'feedback',
    'id': 'iygmca9i57h6bb',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Agree. &#34;Invalid syntax&#34; always forces me to check every single letter I typed, and I kept forgetting commas and colons too.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T18:12:05Z',
    'uid': 'iy855oizpmw524',
    'created': '2017-01-28T18:12:05Z',
    'type': 'feedback',
    'id': 'iyhk16qsyyt310',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I agree, sometimes it can be quite frustrating when you run your code and you are given no hint as to where you went wrong. I typically write my code in IDLE and then run it in shell, but sometimes it is beneficial to run your code line-by-line in shell. That way, you can narrow down your error to only a few words, rather than your code as a whole.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T15:22:37Z',
    'uid': 'ixqua0qbpym7ka',
    'created': '2017-01-31T15:22:37Z',
    'type': 'feedback',
    'id': 'iyloat4nyg84eo',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>You are right, and I can&#39;t agree more. It is quite easy to make syntax mistakes, like the spelling error, spacing error, and missing punctuations. Always make sure everything is correct before fixing &#34;Invalid Syntax&#34;. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T00:53:23Z',
    'uid': 'hzngmn3m83y2ry',
    'created': '2017-01-30T00:53:23Z',
    'type': 'feedback',
    'id': 'iyjdt3m8agq4to',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with this. Its important that you fully understand each step so that you can build on it as the code gets more involved and more difficult. I think it is important to be able to know when you need help, and be willing to reach out to get it. There are so many resources on campus and even on the internet that can help you further your understanding.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T19:03:44Z',
    'uid': 'itq39ktqa3q7m5',
    'created': '2017-01-31T19:03:44Z',
    'type': 'feedback',
    'id': 'iylw75cic9t679',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree when you say that getting stuck on particular problems can bog you down, and that&#39;s one annoying thing about programming that I have struggled with as well. I also agree that programming is based on logic and math, which can be tricky at times. I think that starting anything really especially programming means adjusting to something that seems completely foreign at first. It&#39;s also extremely important to understand the basics before continuing on to harder problems. I believe that a lot of programming involves looking things up online,\xa0\xa0but I totally agree when you say that getting help from various resources are very beneficial as well.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:56:15Z',
    'uid': 'ieoexgyeEev',
    'created': '2017-02-01T03:56:15Z',
    'type': 'feedback',
    'id': 'iymf7z9rue1m6',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with what you&#39;re saying. It does seem like we are learning the alphabet all over again. It is really satisfying to work really hard on an answer, and then come up with a code that works well. It seems well worth the effort and the hours we are putting in to understand the code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:51:10Z',
    'uid': 'iy855uf9jes58h',
    'created': '2017-01-28T20:51:10Z',
    'type': 'feedback',
    'id': 'iyhpprkhdl53er',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>The CS help room does help as well as office hours. However, I do believe working out the code through the trial and error method will be a great benefit as well. Inserting print statements in after each calculate statement can show each step Python is taking and sometimes you can spot exactly where the error in your code is.\xa0</p>\n<p>When I am still stumped after I racked my brain on the code for a while and can&#39;t connect any more pieces, the office hours and help room do work wonders!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T02:58:53Z',
    'uid': 'hsz0y03owlu2n',
    'created': '2017-01-30T02:58:53Z',
    'type': 'feedback',
    'id': 'iyjiahngfcb5sg',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that working it out through trial and error would be most beneficial, but for someone who has never programmed before, it may be more challenging trying to figure out how the computer &#34;thinks&#34;. You have to write code in a way that the computer will understand exactly what you want, and, at first, its difficult to grasp that way of thinking. In this case, it would be beneficial to seek help until you get the hang of it.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T22:17:44Z',
    'uid': 'idtd21byxQB',
    'created': '2017-01-31T22:17:44Z',
    'type': 'feedback',
    'id': 'iym34nb2fxm583',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Going to help sessions is a very beneficial strategy to use in order to succeed in CS177. There will be many people there that can help you and provide you with the help you need. However, I think that before one goes to a help session, they should consult their group members or other people in their class if they are having trouble understanding a concept, since there may be too many people at the help session. Nevertheless, if seeking professional help is needed, I would suggest that\xa0the person go to help sessions at least 2 days before their assignment is due so they can truly understand the concepts rather than rushing to find the answer\xa0and get it done fast before the due date.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T00:52:28Z',
    'uid': 'iy855pke6cw52v',
    'created': '2017-01-28T00:52:28Z',
    'type': 'feedback',
    'id': 'iygiw7qivs5625',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Teaching others, for me is the fastest to learn something so I definitely agree with your advice. Like you said, I feel that teaching someone or even just talking through something yourself is a great way to catch your mistakes and fix them.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:36:14Z',
    'uid': 'hza6g6bsqw143y',
    'created': '2017-01-28T20:36:14Z',
    'type': 'feedback',
    'id': 'iyhp6kci81z3tp',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I would definitely echo this sentiment of walking through your code in an active fashion, whether it is in discussion with someone else or on your own. In addition, the use of pseudo-code in the very beginning can help establish your thoughts regarding your planned algorithm on paper. If you can write down what your process is in an understandable manner that is able to be followed by either you or someone else, then it is simply a matter of figuring out a method (Preferably an efficient one, at that) of implementing your thoughts.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:42:55Z',
    'uid': 'i55x6owyucl1ps',
    'created': '2017-01-28T20:42:55Z',
    'type': 'feedback',
    'id': 'iyhpf5aec331qb',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I do agree teaching other can help remember different basic syntax and methods to get accurate outputs. However, do be careful in advance CS/ECE classes. I have seen numerous student who got in trouble by teaching his/her way of coding to others and get called by the professor and the Dean because\xa0other students starts to have similar code structure to yours.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T19:09:46Z',
    'uid': 'ijelfdjoxbm47o',
    'created': '2017-01-31T19:09:46Z',
    'type': 'feedback',
    'id': 'iylwex1e22pq2',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Talking through your program with somebody else is definitely a great method for reassuring yourself whether or not you know what you&#39;re talking about. However, a good way to catch your mistakes initially is to make comments throughout your program. That way, you yourself can be kept on track in regards to your initial purpose of the program, and somebody else who&#39;s viewing your program for the first time can even see what you&#39;re trying to do and may catch any lingering errors - if any.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T04:57:17Z',
    'uid': 'iefr0iq4Wvz',
    'created': '2017-02-01T04:57:17Z',
    'type': 'feedback',
    'id': 'iymhegyjs1y31w',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is an important point to understand. Often there is a temptation during the beginning stages of learning to code to just try things out until something works, rather than really understanding what is being done.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T01:02:41Z',
    'uid': 'i4x3trk3i6iqo',
    'created': '2017-01-28T01:02:41Z',
    'type': 'feedback',
    'id': 'iygj9d9gyl05z9',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Definitely agree that unfortunately Google is not the right place to look! Usually the results are more confusing than helpful and don&#39;t actually help you learn how and why a piece of code works. Sometimes it&#39;s ok for a quick query, but would steer clear of copy-pasting too much.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T14:14:13Z',
    'uid': 'iy855pp8g2t530',
    'created': '2017-01-29T14:14:13Z',
    'type': 'feedback',
    'id': 'iyiqz4vs89t46x',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I would also add that Piazza is a great place to go when you need help with assignments. For prelab 2, someone else had posted a problem they were having with their code, and Professor McFall answered it rather quickly. I didn&#39;t even have to post myself, but got the help I needed, as the other student and I had the same issue.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-27T22:55:32Z',
    'uid': 'iy855t7x748565',
    'created': '2017-01-27T22:55:32Z',
    'type': 'feedback',
    'id': 'iygepuculfn471',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I certainly agree with Carolina&#39;s statement in reference to reading the textbook. This too has greatly enhanced my understanding. In fact, even trying the examples in the book, as well as answering the questions in the back of each chapter, is also very helpful. I have found that doing the problems has made it easier to use commands in my actual coding.\xa0</p>\n<p></p>\n<p>I actually made the mistake of not reading the directions in the pre-lab fully. Then I was a bit lost, when the answer was clearly in front of me.\xa0</p>\n<p></p>\n<p>I have also found experiment to be useful, because sometimes you are only missing one space somewhere, and it can be very frustrating. This can help relieve you from spending time on just figuring out where a space is missing.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T05:27:38Z',
    'uid': 'ijb1rizi4eq1z6',
    'created': '2017-01-28T05:27:38Z',
    'type': 'feedback',
    'id': 'iygsq3mxzmq485',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>For homework I would add that it is also useful to learn how to read and understand why codelab will mark parts of your code as wrong. \xa0Initially it&#39;s a little confusing when you submit something to codelab thinking that it will work and it doesn&#39;t. \xa0Codelab will highlight the parts of the program that are wrong and the quicker you learn how to interpret why codelab is marking that part of the code as wrong the easier it will be to correct that part of the program. \xa0 A lot of my mistakes were easily resolved when I finally understood why codelab didn&#39;t accept my program.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T01:55:36Z',
    'uid': 'is2sdsd933o2p1',
    'created': '2017-01-28T01:55:36Z',
    'type': 'feedback',
    'id': 'iygl5epxnbu5he',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Reading the book is really helpful, especially we need to submit the assignment before attending the lecture.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T02:58:19Z',
    'uid': 'iy855vn5gxc5ii',
    'created': '2017-01-30T02:58:19Z',
    'type': 'feedback',
    'id': 'iyji9ryvlv05du',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with this, the textbook has been an invaluable resource to me. It is made to teach people how to code from scratch, and as such is incredibly helpful when there is a portion of the homework or lab prep assignments I don&#39;t understand. Going into this class with no coding experience whatsoever has required me to look up many concepts in the back of the book, but they have always been easy to understand once I read through the text.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:54:17Z',
    'uid': 'iy855p8kf0h52q',
    'created': '2017-01-31T03:54:17Z',
    'type': 'feedback',
    'id': 'iykzplhd1fb1wu',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I find it also helpful to read the books often. Being a beginner to computer science, I think our Python book is a good guider for us. And also with reading our books, we should also understand and practice how to write codes.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:34:16Z',
    'uid': 'ixpj13quqcz5ns',
    'created': '2017-01-31T23:34:16Z',
    'type': 'feedback',
    'id': 'iym5v2byk936ew',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with you. I find reading the Python book is also really helpful. Being in a big class with large amount of students, it&#39;s important for us to read the books regularly by ourselves and understand the key concept of the Python book.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T16:04:27Z',
    'uid': 'iy855rmn1eu54j',
    'created': '2017-01-29T16:04:27Z',
    'type': 'feedback',
    'id': 'iyiuww68mip205',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Hi Erika,\xa0</p>\n<p>I really think your first point has been my biggest challenge this semester! I usually like to start and finish assignments in one sitting and be able to &#34;check off&#34; another item on my list. But that isn&#39;t always possible with this class and the assignments as they seem to be more problem solving based and there is usually trouble shooting involved. It has been helpful for me to practice patience and sometimes step away from the assignment and come back later and try again. I think that starting as early in the week as possible is important so that you have the freedom to be patient, go slow, and try again (as your third point says.. making mistakes usually leads to better learning!)</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T20:09:21Z',
    'uid': 'iy855ru0iz154p',
    'created': '2017-01-29T20:09:21Z',
    'type': 'feedback',
    'id': 'iyj3nu4bjuwnd',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree, your first point has also been a challenge for me!\xa0It is definitely a new way of solving problems, and it&#39;s been difficult to start thinking &#34;like a computer&#34; instead of like a person. When I&#39;m writing code I realize that I make assumptions that the computer can&#39;t make, so that has been a big lesson for me. Like Carolina said, sometimes it helps to step away from the problem and\xa0let yourself think about it for a while before you try to solve it again. The book also has really good examples within the chapters that are similar to our assignments, so those have been helpful as well when completing the homework and prelab assignments.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:53:51Z',
    'uid': 'hz4jybf6brmds',
    'created': '2017-01-31T03:53:51Z',
    'type': 'feedback',
    'id': 'iykzp133c335qp',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think you make a really good point about being patient with yourself. I think that using Python is a bit similar to statistics in that it builds off of the math and language you know, but its a different mindset and way of looking at problems. Its important to keep in mind that you&#39;re starting from nothing and building up from there, and being patient is a big part of this. I also think that patience and thoroughly learning the basic skills of Python programming will definitely be more beneficial in the long run.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T16:34:32Z',
    'uid': 'isuhh149wfb22n',
    'created': '2017-01-28T16:34:32Z',
    'type': 'feedback',
    'id': 'iyhgjqgrxnx4ow',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I feel the same thing. It is a challenge to study ahead. I practice by using IDLE and read textbook first, and then try to finish the homework.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:59:53Z',
    'uid': 'itdegkreedi2p3',
    'created': '2017-01-31T23:59:53Z',
    'type': 'feedback',
    'id': 'iym6rzynia33lv',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>The book does help a lot, since all assignments are based on the book.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T03:56:24Z',
    'uid': 'iy855osk6qo52b',
    'created': '2017-01-28T03:56:24Z',
    'type': 'feedback',
    'id': 'iygpgrv98v537c',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I also am not a CS major, so I found the learning curve to be a bit difficult, or at least different from my other classes. I agree that doing some practice/learning before the course starts would put you at an advantage and make the course initially easier. I think reading the book while taking the course prior to class may also help a new student out, as well as going to get help from the newly opened resource room. Finally, practice is essential for getting better and learning python programming.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T02:59:23Z',
    'uid': 'ijj7dr2cmhl5ej',
    'created': '2017-02-01T02:59:23Z',
    'type': 'feedback',
    'id': 'iymd6uluw69522',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Your post reflects the same experience that I am going through. I also find it difficult to remember every single detail required to give a certain instruction but I find it useful if I continue to practice on the assignments. Mentioning office hours is great advice for anyone who is having difficulty in the course as well as practicing with python is useful. Overall, I feel as though your post was very similar to mine and practically many other posts as well. I believe that the general message that ,many of us are trying to send is that practice is crucial in learning a programming language and making time for office hours/other resources\xa0can be to your advantage (if used routinely).</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T17:10:12Z',
    'uid': 'iy855stk7cc55t',
    'created': '2017-01-28T17:10:12Z',
    'type': 'feedback',
    'id': 'iyhhtl4l4ar78g',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T01:14:50Z',
    'uid': 'ixqdd3h69b21vt',
    'created': '2017-01-29T01:14:50Z',
    'type': 'feedback',
    'id': 'iyhz4uamqff4yf',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Very helpful and detailed suggestions! These advices give me much inspiration. Python reference library really does me a big favor when I met with problems. There are many useful information on the internet which can be very helpful. In addition, flow chart is a good way for both beginners and masters to solve problems.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T23:32:46Z',
    'uid': 'iy855tlhrt56i',
    'created': '2017-01-29T23:32:46Z',
    'type': 'feedback',
    'id': 'iyjaxfinu1a2zs',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I would agree with this post - especially when it comes to commenting on your code. If there is one thing that will help a student when an exam comes around that is open note, don&#39;t be afraid to over comment. The more detail you put in now, the more powerful your code will be, as you can and will know how to command every detail of your code. This is extremely useful for not only exams but also for jobs later on where you may run into some small coding you will have to do. Commenting is a professional practice, as you never know if another person will have to use your code.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T21:05:12Z',
    'uid': 'iy855rfr1zu54b',
    'created': '2017-01-30T21:05:12Z',
    'type': 'feedback',
    'id': 'iykl3iimsrz7cs',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I honestly agree with the comment &#34;make it fun/ make it useful&#34;. I personally believe in trying to make a subject that you don&#39;t know too much about, as interesting as possible. This gives me motivation to really sit down and learn the material. I&#39;ve also been playing around with IDLE in my spare time as well. I also believe having the knowledge of Python is useful for my other classes, such as economics, because if you are able to write a successful program, then using it to solve equations for you is very convenient and it makes the work a lot easier. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T04:47:12Z',
    'uid': 'idnhwe1zxjr5od',
    'created': '2017-01-28T04:47:12Z',
    'type': 'feedback',
    'id': 'iygra39p2857f',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Taking a break and taking a few steps back from the program can be really useful because you can easily get tunnel visioned trying to get a certain part of code\xa0to work, especially if it keeps spitting out errors or wrong answers for no apparent reason. There may be a simpler way to do it or maybe a function built into python&#39;s programming already does what you&#39;re trying to code, but\xa0there&#39;s no way you&#39;re going to find this simpler path if you only try brute forcing your way to a working program.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:26:30Z',
    'uid': 'if7hvcuoKS7',
    'created': '2017-01-28T20:26:30Z',
    'type': 'feedback',
    'id': 'iyhou1kt2x27p',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree with you! I am also a biology major and feel the same way about memorizing concepts. Computer science is much more than that! I will take your advice about trying some coding every day to improve my programming skills. That way, I can get more and more accustomed to writing code and learning what output it produces.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:52:03Z',
    'uid': 'hz5sohdcqvp5eh',
    'created': '2017-01-31T03:52:03Z',
    'type': 'feedback',
    'id': 'iykzmq44xw6rp',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Devang,</p>\n<p>I am also a bio major. I like how you said spending some time everyday. This is some highly under-rated advice. This is definitely not a class where you can cram the week before an exam...It&#39;s like a marathon and you have to build your knowledge base and experience slowly but surely. It can&#39;t be rushed! It will just backfire</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:20:10Z',
    'uid': 'isdjojtuMwD',
    'created': '2017-01-28T20:20:10Z',
    'type': 'feedback',
    'id': 'iyholwme7ha2lg',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I agree with your opinion. When I first wrote down some codes, I found that missing a comma or changing the orders will present completely difference outputs to you and even lead to some errors. Being careful is very important. So I also mentioned in my post that practicing is the best way to learn and help you find where you have made any mistakes. And of course, getting help from TAs, professor, etc is also very important for a beginner if you can&#39;t find a way to learn coding.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T01:14:15Z',
    'uid': 'hz4jyc0d6k5eu',
    'created': '2017-01-30T01:14:15Z',
    'type': 'feedback',
    'id': 'iyjejxo11x719o',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with Rebecca! Attention to detail is crucial. A lot of the time, the homework won&#39;t accept your code because your final output is missing a space or something similar. To expand on the idea of getting help in the course, you can even talk over ideas and functions with other students - just don&#39;t share code or correct each other&#39;s code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:08:19Z',
    'uid': 'iy855rea95u549',
    'created': '2017-01-31T20:08:19Z',
    'type': 'feedback',
    'id': 'iylyi7wi8292xt',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with Rebecca. Sometimes\xa0it&#39;s a small mistake that can throws off your program. Thats why its best to take things slow, and actually study the material that is provided for you. Also great advice to use the resources that are provided such as the book, TAs, tutors, and professors.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T17:16:57Z',
    'uid': 'is90whv4yci7p2',
    'created': '2017-01-28T17:16:57Z',
    'type': 'feedback',
    'id': 'iyhi2a1a3vy6hw',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree with the &#34;experimenting&#34; bit. I&#39;m not sure about a lot of others but going through the action of typing the code and what the different outputs are one way versus another can be more beneficial than just staring at a book. I know that even if I know some code I&#39;m typing is incorrect, it still helps me knowing what the output is when I do it the &#34;wrong&#34; way. After a number of attempts, you will realize what works and what doesn&#39;t.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T16:44:47Z',
    'uid': 'iy31yofjvux53z',
    'created': '2017-01-28T16:44:47Z',
    'type': 'feedback',
    'id': 'iyhgwx3x8z52tu',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I think this is really good advice, because I often find myself stuck and then go back to the textbook and see that the answer is right there. I&#39;ve found that the textbook is a really good place to start and understand how a particular function works. The other thing that helps is trial and error, because working through the little problems in your code will help you to write better code in the future.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T22:31:57Z',
    'uid': 'ijabk7is7ubw1',
    'created': '2017-01-28T22:31:57Z',
    'type': 'feedback',
    'id': 'iyhtbd4dgc96xt',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I certainly agree with you about making good use of the examples in the textbook. Though formulating the program is the key to making it work, you cannot just write codes without knowing what results of those commands will be. If you don&#39;t understand the definition of a command, you hardly know whether the result is right or not. Getting familiar with simple commands and functions definitely helps you when you create programs later and your coding skill will be built up. By making mistakes and fixing them, you will learn and make progress fast. Additionally, working on problems on CodeLab also helps since you can get detailed feedback on your each wrong submission. You can also try to solve a problem in different ways and see which approaches work better and which do not even work. It is always true that you learn while practicing.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:50:30Z',
    'uid': 'i4uxau616kdsc',
    'created': '2017-01-30T17:50:30Z',
    'type': 'feedback',
    'id': 'iyke54sd61d4gv',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>As a new CS student I agree that practice really helps you understand a topic. The homework really helps to solidify your skills by practicing over and over. The textbook is also a great way to get explanations of what a certain code will do. It is important to be able to recognize if there is a certain part of your code that needs to be changed.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T04:46:28Z',
    'uid': 'iy855uz4ay15ei',
    'created': '2017-02-01T04:46:28Z',
    'type': 'feedback',
    'id': 'iymh0jtg71p7nw',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think a balance between the textbook and practicing is crucial. Only reading the textbook or only practicing code wouldn&#39;t be very effective for me at least. So, I think your advice to read a concept and then try it out yourself is a very good way for a beginner programmer to solidify techniques for future use.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T16:48:47Z',
    'uid': 'hkecxee5k2h38c',
    'created': '2017-01-28T16:48:47Z',
    'type': 'feedback',
    'id': 'iyhh220kuph33z',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Taking breaks when I am coding is very helpful to me. Oftentimes during my breaks I am subconsciously thinking about the problem and it helps me realize what mistakes I have made or what I need to add.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:37:02Z',
    'uid': 'iy855ryjp1g54u',
    'created': '2017-01-28T20:37:02Z',
    'type': 'feedback',
    'id': 'iyhp7kva8b22xy',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree with this advice! For me, just breaking the problem down into smaller problems is a huge help. I try to think through everything I need from the user, what equations or conversions I might need to use, and how I want to display my results before I start writing my code. It can be so tempting to just jump in and try to start writing, but planning ahead of time saves a lot of frustration in the end. I also think taking breaks is a really good idea. With prelab 2, I was getting really frustrated and kept making small changes that weren&#39;t making a big difference. When I finally stepped away for a while, I realized that I had to change some formatting with the for loops to get them to run properly and then it was much easier to complete.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:38:51Z',
    'uid': 'iy855trx9o156o',
    'created': '2017-01-28T20:38:51Z',
    'type': 'feedback',
    'id': 'iyhp9x44982663',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree that it is helpful to make a plan and break down the problem into more understandable steps. I was not doing this at the beginning of the course and instead I would just jump right into the code. Not only did this take longer but I found it difficult to actually connect the code I was writing with its function in solving the problem. In my opinion, learning computer programming languages is similar to learning spoken languages. Just as you break a sentence into different parts to be conjugated, the code also has sections that need to be formatted differently. Also, each part of the code has a specific meaning and purpose. Even a tab is there for a reason so it helps to connect these formatting changes with their function in solving the problem at hand.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T17:23:17Z',
    'uid': 'iy855stk7cc55t',
    'created': '2017-01-28T17:23:17Z',
    'type': 'feedback',
    'id': 'iyhiaf3gzsz79s',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I think that this is really great advice!\xa0If I would have read the book more carefully and actually worked through the examples during the second week of the semester, then I would have had my homework done a lot sooner. I was struggling with the &#34;factorial&#34; homework problem, which I later realized was an example written\xa0out in the book. So, had I read more carefully and actually practiced what I read on python, then I would have had a much easier time on the homework. I am definitely going to do this in the future.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T17:01:42Z',
    'uid': 'iy855vey3so5id',
    'created': '2017-01-29T17:01:42Z',
    'type': 'feedback',
    'id': 'iyiwyijcohj6i5',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree that the textbook is a great resource, especially if you have never had any past coding experiences. I also found working through the examples gave me a better understanding of certain parts of code since you are looking at each step closely to learn why each step is necessary.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T18:00:11Z',
    'uid': 'isjm9ia6jwn6kp',
    'created': '2017-01-30T18:00:11Z',
    'type': 'feedback',
    'id': 'iykehkju1774p2',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Practice makes perfect, so I totally agree that working through examples in the book can be extremely beneficial! The book does a great job of breaking down exactly what each part of the code means, which can be very helpful when you have no idea where to start! It can be frustrating when homework problems are not demonstrated exactly in the book, but there are always problems that are similar that can be broken down to help you figure out the code. I also agree that these assignments take time - the biggest mistake I made the first two weeks was waiting until the last minute to finish my homework. Lastly, I think it is important, like you said, to make sure you understand what you are typing! Just because you were able to figure out the answer does not necessarily mean you totally understand it! Be sure you understand exactly why you are writing the code the way that you are - this will be beneficial when it is time to start studying for exams.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T04:47:30Z',
    'uid': 'iy855uh6pop59a',
    'created': '2017-01-29T04:47:30Z',
    'type': 'feedback',
    'id': 'iyi6qbiod3e1z3',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Emily!\xa0</p>\n<p>This is very helpful advice. In fact, it was advice that I recently tried since I do not follow the book very well. I am a visual learner and would much rather watch how people work through programming problems than read about them. To be 100% honest, there&#39;s been many times when I have no idea what I am doing! The professor and TAs were not available during a lot of those times and so I tried looking to the internet for help. Being able to see how others faced programming problems opened up my eyes to different approaches that I could take as well. It is just another way of trying to understand Python outside of class. I am not saying that the book is a bad source, because it has helped me with many assignment problems. It is just a bit harder for me to comprehend. For some people it takes many different explanations of a topic for them to be able to understand it. Youtube videos can serve as some of those extra explanations.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:04:28Z',
    'uid': 'iy855pfo9on52t',
    'created': '2017-01-28T20:04:28Z',
    'type': 'feedback',
    'id': 'iyho1pg7iuj6rh',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I think the advice about homework assignments is very valuable. I would also add that reading the results CodeLab gives you if your code is wrong should not be overlooked. It offers advice on what to change in your code by highlighting parts of your code. It also shows you what your output was in comparison to the expected outcome, so you can see how close you were. This results tab helps point you in the right direction.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T04:13:29Z',
    'uid': 'iy855s9sjkx55b',
    'created': '2017-01-29T04:13:29Z',
    'type': 'feedback',
    'id': 'iyi5ilfjosblv',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Exactly! I have a hard time figuring out what to do sometimes.\xa0 The problems seem to give you A and ask you to get Z.\xa0But recently, I have been using the comments more to help me break down the problem and it definitely helps with\xa0getting to a solution.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T21:22:01Z',
    'uid': 'isuhhepqj1r2jl',
    'created': '2017-01-30T21:22:01Z',
    'type': 'feedback',
    'id': 'iyklp50ev9m6fd',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I noticed the importance of comments too in the last lecture. It became such a problem in one of the Prelabs when I kept forgetting to initialize all of my variables and it became a jumble of &#34;I wanted x to represents what again?&#34;. One thing I always do with the starting comments is coming up with unique names for each variable instead of w, x, y, z. Instead I write my friends names, foods, etc. and it makes the code easier to track and read when I am trying to find errors!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:49:33Z',
    'uid': 'ijdn7uhkRxi',
    'created': '2017-01-28T20:49:33Z',
    'type': 'feedback',
    'id': 'iyhpnoek2z132f',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Adding to this, I&#39;d save everything that you code and completed programs that you&#39;ve done so that you can refer back to them if you get stuck. Organization is key here.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T23:10:09Z',
    'uid': 'is6em9qf1ni5wq',
    'created': '2017-01-29T23:10:09Z',
    'type': 'feedback',
    'id': 'iyja4cr8wo34k',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Just some thoughts building off of 2.</p>\n<p>I find that when I take the time to analyze a problem, I not only cut down on time spent writing the code, but the code itself comes out neater and organized. As someone who likes to jump in and start writing before analyzing, I can say that my code is a lot cleaner and more efficient when I take the time to write out a plan. Writing down the flow of your program on paper can be helpful if you are not sure of how to accomplish the assigned task.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:25:50Z',
    'uid': 'iew1xne4jq11kg',
    'created': '2017-01-31T20:25:50Z',
    'type': 'feedback',
    'id': 'iylz4qqyndo13m',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with you. I think we should finish\xa0the pre-lab and assignment as early as possible. You will have more time to solve the problem and you can bring your question to the office hour.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T20:22:01Z',
    'uid': 'iy855s8esea558',
    'created': '2017-01-29T20:22:01Z',
    'type': 'feedback',
    'id': 'iyj4449qv7an2',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree! You can&#39;t just memorize solutions - if problems change just a little, that can dramatically change the solution. Along with learning the basics, I\xa0also\xa0make sure to learn the syntax of basic functions (and write them down too for easy reference!). I literally have a list of different functions (for loop, print function,\xa0lists [this will come later haha], etc.). Knowing the full extent of their capabilities is very\xa0useful too.</p>\n<p></p>\n<p>I, then, try to think when I would use each function\xa0and commit it to memory so I can know which ones to use with problems. For example, if I need to write a code that performs the same command over and over for a number of times but also needs information that will change each time you run it or from somewhere else in the code, I know I need to use a &#39;for loop&#39; (instead of a while loop which makes it do something forever until you tell it to stop) and\xa0set my variable\xa0= to another variable\xa0(instead of defining a variable myself).</p>\n<p></p>\n<p>It&#39;s tricky but as someone\xa0who is working on her 2nd semester of coding (ever), I will tell you the more you practice similar types of problems, the easier it becomes! Even if you have never seen a problem before - you learn how to be self-sufficient and where to look for clues to make progress.</p>\n<p></p>\n<p><a href="https://www.piazza.com/class/iy30s5dau7i2ap?cid=10">&#64;10</a></p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T01:57:54Z',
    'uid': 'iy855rl6pft54g',
    'created': '2017-02-01T01:57:54Z',
    'type': 'feedback',
    'id': 'iymazs8w1xx6s6',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>As an international student I have also found the structure of the class to be challenging. Coming from an entirely different educational system, British University is primarily focused on individual learning with very little homework and no midterms. As such, I spend a lot more time conducing individual research and, when it comes to programming, time in labs repeatedly practicing my code. As an astrophysicist, this compliments the problem solving skills I have learned.</p>\n<p></p>\n<p>In this class however there is a lot more discussion, engagement with professors, assessed lab work and homework assignments. Like you, I have found early preparation of work and essential part in making sure I don&#39;t run out of time and have the basics nailed. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-28T20:53:36Z',
    'uid': 'iozz9h59y7e21v',
    'created': '2017-01-28T20:53:36Z',
    'type': 'feedback',
    'id': 'iyhpswgkxel5iq',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>I agree that StackOverflow is helpful but overwhelming sometimes, but I believe that it should only be used when you are completely stuck and can&#39;t move forward at all--do so allows you to try and fail and eventually succeeding...actually learning the methods.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T23:17:22Z',
    'uid': 'is6em9qf1ni5wq',
    'created': '2017-01-29T23:17:22Z',
    'type': 'feedback',
    'id': 'iyjadmw0xlr1uh',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>In addition to what was suggested above, I would also suggest keeping all of your old homework and labs. That way you can look back at previous work. That way, you have some completed structures that you can use to base ideas off of. In addition, I find looking back over my old code can sometimes remind me of different ways to solve a problem. Sometimes when I am stuck on a problem, I look for a problem that I have previously solved and use that code as a guide to solving the new problem.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T19:33:37Z',
    'uid': 'hkfgguonbqe10l',
    'created': '2017-01-29T19:33:37Z',
    'type': 'feedback',
    'id': 'iyj2dvsg6qp1iq',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Sarah, I really like your advice about opening Python and practicing along with the textbook! A lot of your advice involves working alone, so my suggestion for a new student who works better in groups would be to use other resources like the help room or Piazza.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T05:55:09Z',
    'uid': 'isuhha5hj9f2ee',
    'created': '2017-01-29T05:55:09Z',
    'type': 'feedback',
    'id': 'iyi95bwel1t3ih',
    'anon': 'no',
    'bucket_name': 'Week 1/22 - 1/28',
    'config': {},
    'bucket_order': 8,
    'data': None,
    'children': [],
    'subject': '<p>Google does contain a lot of information about Python but I do find the book to be a helpful tool. To me I believe it depends on the student; everyone learns in different ways so even though one student might not benefit from the textbook another student might. I completely agree about contacting the TA&#39;s. All of them are very knowledgeable on the subject being taught and they can help explain and help you understand problems you wouldn&#39;t have been able to understand on your own.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T14:16:58Z',
    'uid': 'iy855t9iav9568',
    'created': '2017-01-31T14:16:58Z',
    'type': 'feedback',
    'id': 'iyllyda3c5cv3',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I do not think that I would advise new students to use google on other online resources for assignment help, at least as their first resource. In my experience, this lead to formatting and functions that we had not learned yet, and ended up confusing me more. While what you find online may allow the program to run, it could end up in misunderstanding what the code is actually doing, and how to apply those principles to a different problem. For example, without knowing why or how a code\xa0works, you will not be able to manipulate it to use it again in a lab or exam.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:26:47Z',
    'uid': 'igldx742SYv',
    'created': '2017-01-30T17:26:47Z',
    'type': 'feedback',
    'id': 'iykdamuoruu308',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>&#34;The easiest way to keep on track is to have a grasp of the topic before coming to lecture. You don&#39;t have to know the ins and outs, just make sure you&#39;re able to keep on track. Look at the syllabus and see what you should look up beforehand.&#34;</p>\n<p></p>\n<p>This is such a good piece of information to give someone. It will help them &#34;learn how to learn&#34; and will make the student absorb more information during lectures and recitations.</p>\n<p></p>\n<p>I think that it COULD hurt the student writing the code for a certain example down in their notes. It is definitely nice to have a reference if they get stuck but if they simply look at their notes and copy the loop down, then I don&#39;t think this enhances their understanding. In my experience with coding and helping friends with assignments from a previous class, I think it is more beneficial to have an understanding of how to write the code than to have that section of code written out in their notes. I think they will learn more thinking and re-writing the loop than referencing an old piece of code. However, I think it is better to look at an old piece of code than to spend an hour trying to write a function that will compute the average.</p>\n<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T21:12:23Z',
    'uid': 'isbb4irso3o7oa',
    'created': '2017-01-30T21:12:23Z',
    'type': 'feedback',
    'id': 'iyklcqov5np1ln',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with this. There have been several times in the first few homework&#39;s/pre-labs where I had no idea where to start or had half of it done and did not know where to go from there. Looking in the book can really help clear up some of your questions and problems with your code. Logic is also a very key thing to use. Looking in the textbook will not always help you with your code. Sometimes just step back and look at your code and there will be a simple equation or statement that is formatted wrong and it will fix the code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T18:56:01Z',
    'uid': 'iy855u1fl7q56y',
    'created': '2017-01-31T18:56:01Z',
    'type': 'feedback',
    'id': 'iylvx86atmkso',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that you have to be patient with this class. Computer science is not something that you can learn overnight. Coding is a process that takes a significant amount of trial and error. Also, when something doesn&#39;t make any sense to me, I find Google and the textbook to be the most reliable resources.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:07:45Z',
    'uid': 'is7sdtypogp3iv',
    'created': '2017-02-01T00:07:45Z',
    'type': 'feedback',
    'id': 'iym724tn33qmb',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that trial and error is a very large part of coding. Whether you do or don&#39;t know the functions you need to make a program that you want might not matter in some cases where the problem is complex. However, if you&#39;re patient enough to figure out what the errors you&#39;re encountering are, you&#39;ll be able to figure out how to resolve them. It also helps a great deal to plan out your code in comments as much as possible so that you can find certain sections easier and visualise how the code should be completed.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T19:12:24Z',
    'uid': 'iaydho58WxZ',
    'created': '2017-01-29T19:12:24Z',
    'type': 'feedback',
    'id': 'iyj1ml7uflb7jl',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This advice was really good! I agree that it is a different way of thinking, and have also found that the TA&#39;s have been very helpful. I definitely need to start trying more before going to TAs like you suggest. Along with the TA&#39;s I have found the internet to be another very helpful resource when it comes to trying to figure out the pre labs and hw.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T23:21:45Z',
    'uid': 'hz5sohnknmz5f0',
    'created': '2017-01-29T23:21:45Z',
    'type': 'feedback',
    'id': 'iyjaj9qzhhv30q',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Maaz, I think this is a very good overview of how a lot of us Biology students feel about this class and coding in general. Rather, it is at least how I feel about it as well. I think you are very correct in saying that instead of just asking for help, it is more beneficial to spend time dwelling on a problem and learning by trial and error. If one just asks for the answer there is no real learning in CS, they are only solving the problem at hand and this solution only has a limited generalizability to other problems and codes. Lastly, your advice to look over past examples is very true as well. Looking at various ways to complete a task is a great way to learn and improve on ones coding skills.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T04:38:04Z',
    'uid': 'iy855qvss8j53q',
    'created': '2017-01-30T04:38:04Z',
    'type': 'feedback',
    'id': 'iyjlu1s0djo56s',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is very good advice for a new coder like myself! I had problems with distinguishing between the Shell and Idle at first, and it really messed up my first Pre Lab assignment. Now I have learned that the shell isnt a place to write and save programs, just to test snippets of code. Once you can understand this difference, it makes testing and writing code much easier. In addition I cant stress reading the textbook enough, it contains many good examples with concepts that make doing the homework much easier.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T15:51:20Z',
    'uid': 'ixqmtaeiii41gg',
    'created': '2017-01-29T15:51:20Z',
    'type': 'feedback',
    'id': 'iyiug19g8wu4br',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<span style="background-color:#fff">Good morning Sarah! I couldn&#39;t agree more. There definitely is a whole different thinking prospective when it comes to coding! The hardest thing I&#39;ve found is translating what I want it to do into the correct code. And as you stated this just comes from repetition and trial and error. and when you&#39;re stuck and can&#39;t seem to figure it out don&#39;t hesitate to ask questions to your TA/professor/ classmates to help you understand the concepts so you can learn them more thouroughly and expand you python coding abilities!\xa0</span>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T20:59:49Z',
    'uid': 'hz4jycny6jxfv',
    'created': '2017-01-30T20:59:49Z',
    'type': 'feedback',
    'id': 'iykkwl1dnzl4o8',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Another reason repetiton helps is that you&#39;ll run into more mistakes and learn how to recognize them in the future. Some syntax errors won&#39;t get noticed by the interpreter and you can spend a long time trying to figure it out.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T15:09:18Z',
    'uid': 'ixpks24i8m31br',
    'created': '2017-01-29T15:09:18Z',
    'type': 'feedback',
    'id': 'iyisxywdzsr7pg',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Hi Alexandra,</p>\n<p></p>\n<p>Thanks for sharing so much useful suggestions! I am also a non-CS major, and I think the most difficult part of this class may be the transforming between the way of thinking in or own subjects and programming language. So I do think it will be helpful to keep checking and run your program to see if you get the desired outcome. Also, other than watching videos, I think we can also summarize some typical usage of commands and distinguish them. Furthermore, I can&#39;t be more agree to maintain an open mind in this course. Keep confident and keep trying, there will be a\xa0good result.</p>\n<p></p>\n<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T21:40:06Z',
    'uid': 'isc0cydtOz4',
    'created': '2017-01-29T21:40:06Z',
    'type': 'feedback',
    'id': 'iyj6wjgvq8n6uu',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that learning to code is like learning a new language. That is one of my struggles in this class because I have to learn how to write in &#39;Python&#39;s language&#39;. Also, the programming\xa0troubleshooting process is new to me. Since I am also a non-CS major, the only troubleshooting I have to do is done in the lab. I am familiar with troubleshooting equipment malfunctions or experimental design. What&#39;s new to me is that an error in my code could be because of something so small like a misplaced comma or capitalizing a letter when it should be lowercase. I have to become more familiar with examining every letter/number/symbol in my code when trying to figure out what I did wrong. This problem will become increasingly difficult when our codes become much longer.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T22:35:49Z',
    'uid': 'ids346p4MjG',
    'created': '2017-01-29T22:35:49Z',
    'type': 'feedback',
    'id': 'iyj8w6tit2v6ei',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Alex, I love all of your helpful adive because you are also a non-CS major. It is such an overwhelming experience to have to basically be thrown into this new &#34;language&#34;. I liked your first point. It&#39;s very frustrating to fail over and over again at your first few programs, but the satisfaction that you get once it&#39;s correct makes it worth it. I know I was pretty excited once I got my first code to run properly. I also was happy to see that others were using YouTube as a tool for this course. Being able to watch different examples of coding really made it easier to grasp some of the basic idea. Great advice!\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T21:51:27Z',
    'uid': 'iozz9h216i621s',
    'created': '2017-01-29T21:51:27Z',
    'type': 'feedback',
    'id': 'iyj7b4qj1pc4k',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree that buying the book can make a huge difference in your understanding of a class. \xa0I also agree that doing the homework is a big help, especially due to the helpful hints like you mentioned. \xa0In my experience, office hours have been a tremendous help when I am stuck to the point that the book is not helping. \xa0Office hours can also provide insight to things that you may overlook in the book, or even helpful hints that the book does not contain.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:56:45Z',
    'uid': 'isfyst24ubn3ht',
    'created': '2017-01-30T17:56:45Z',
    'type': 'feedback',
    'id': 'iyked68ij2m6r5',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree. Trial and error is my new best friend, and you hit the nail on the head by pointing it out. You are forced to save every time you run your program, so it&#39;s also a good way to make sure you don&#39;t lose your work. Seeing how the things you change have changed how your code works can be the difference between being totally lost in the jumble of words that is Python, and being able to make your program work appropriately.</p>\n<p>Tyler Spellings</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T03:47:31Z',
    'uid': 'iy855okk2t9526',
    'created': '2017-01-30T03:47:31Z',
    'type': 'feedback',
    'id': 'iyjk11ljytm4l9',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I can definitely relate to this as it is also my first time taking a CS class. I agree that syntax can definitely be a problem and I think you have to be careful because sometimes it can be difficult to locate where the syntax problem is located. One thing I usually try to look for is the color coding aspects of python to make sure all the effects are indicating that I am doing the right things. I have not heard of programmiz but since I too will play around with Python then that is something I will check out! And lastly, I also will go back and edit my past labs and lab preps to become more familiar with Python like you said because I think being comfortable with basics is essential for success.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T17:26:50Z',
    'uid': 'i4olzxojxbuhq',
    'created': '2017-01-29T17:26:50Z',
    'type': 'feedback',
    'id': 'iyixuuean9n16b',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is very good advice! One of the most important points is to ask for help if you need it. CS 177 provides a lot of resources and places to go to get help on assignments if you get suck, and a new student shouldn&#39;t be afraid to take advantage of them when they get stuck on an assignment.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T02:01:15Z',
    'uid': 'isuhgwawj0x1pv',
    'created': '2017-01-31T02:01:15Z',
    'type': 'feedback',
    'id': 'iykvo8j77gy1wn',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with your statement, while the textbook may be a scary thing to try and read it is important. I also find while looking at others code online, there are more then a few tips and tricks they will share. One of my biggest problems at the beginning of the semester was putting off assignments, I have now seen the error of my ways and have found it is way easier to do the homework, if you start early.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T18:09:52Z',
    'uid': 'ijelfe7jygr48b',
    'created': '2017-01-29T18:09:52Z',
    'type': 'feedback',
    'id': 'iyize6dndhc68d',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Thanks for the advice! I have not taken the time to do the practice problems at the end of the chapters, but I will definitely starting doing them. I have found that dissecting the examples of code given in the book can also be helpful in understanding what function each line of code serves.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:02:25Z',
    'uid': 'iy855tb6hcp56a',
    'created': '2017-01-31T03:02:25Z',
    'type': 'feedback',
    'id': 'iykxuwgslfu5fv',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that the book is a lifesaver! \xa0My book didn&#39;t arrive until the second week was done and I had pretty much no clue how to do anything, because as you said we didn&#39;t really learn anything in lecture. \xa0But after reading through everything that we&#39;ve covered, I now have a much better understanding of different tools and commands that can be used in our code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:09:21Z',
    'uid': 'ijelfep8k4n48v',
    'created': '2017-02-01T00:09:21Z',
    'type': 'feedback',
    'id': 'iym746brbtp14s',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>You&#39;re right Ben, the course did seem to start us off on the deep end, but the book really did help in keeping me afloat and be able to realize what&#39;s going on. \xa0I&#39;ve never really thought about dissecting the code in a stepwise way like you described, and I&#39;ll have to try that!!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:46:19Z',
    'uid': 'is6gsxdewne',
    'created': '2017-01-31T20:46:19Z',
    'type': 'feedback',
    'id': 'iylzv32b9tk2pn',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is great advice and is very plausible coming from someone who has taken the class not once, but twice. Taking an extra leap with more practice can behoove anyone in a class like CS 177. Nice job, Michael!</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:12:22Z',
    'uid': 'iuexzk20x1j5e3',
    'created': '2017-02-01T03:12:22Z',
    'type': 'feedback',
    'id': 'iymdnjgajwl6ha',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is very true, as this is the first time I have coded and I struggled with the syntax part for a while. Another thing to prepare for assignments could be going to office hours as well.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T19:40:39Z',
    'uid': 'iy855sday5h55f',
    'created': '2017-01-29T19:40:39Z',
    'type': 'feedback',
    'id': 'iyj2mxrur5i4za',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree! I found a private tutor and I know I ask him basic, &#34;dumb&#34; questions but he helps me and teaches me how to use the basics in a more complex code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T21:13:16Z',
    'uid': 'iec3kuv1agc29',
    'created': '2017-01-29T21:13:16Z',
    'type': 'feedback',
    'id': 'iyj5y1j02bg2ee',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Great advice! I agree that breaking assignments down into multiple steps is the easiest way to understand and finish them. It can be overwhelming to look at an entire lab, but once you think about the step by step process on how to get the output it becomes much more manageable.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T22:40:35Z',
    'uid': 'is64pye1nk52ot',
    'created': '2017-01-29T22:40:35Z',
    'type': 'feedback',
    'id': 'iyj92bu188l6td',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree. Understanding the logic behind code makes it easier to complete problems and it helps you to learn something from problems that can be applied to other coding situations. Breaking a program down into steps is also very helpful in solving problems and understanding the logic behind them.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T21:45:42Z',
    'uid': 'iy855rcosk9545',
    'created': '2017-01-29T21:45:42Z',
    'type': 'feedback',
    'id': 'iyj73qm1iu37d7',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Abby, I think that is a really good point. Debugging is a much more crucial process than I initially realized-- I, and maybe many students taking this course, are used to trying to &#34;find the right answer&#34; and being penalized if we are not able to. It&#39;s a very good insight to note that it&#39;s impossible to learn how to code without failing first, usually a lot. At first, I was very discouraged by this process, so it&#39;s nice to see that I am not the only one with this experience. But, after a few weeks, I&#39;ve learned a lot more from my failures than my successes. I think that is something that should really be impressed upon new students in this course -- it&#39;s OK to make mistakes as long as we learn from them.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-29T23:31:36Z',
    'uid': 'isdtceb6et61ag',
    'created': '2017-01-29T23:31:36Z',
    'type': 'feedback',
    'id': 'iyjavx6smj1kq',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree. It is one thing to have a program that works and another thing to have a program that works efficiently. While this may not seem important now, it becomes more crucial as programs get more complicated. Also, it helps save our valuable time! Adding and removing different lines is a great way to find out the purpose of different parts of the\xa0code. It shapes the thinking processes that we are developing while looking at these programs.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T01:33:20Z',
    'uid': 'iy855skdh5x55k',
    'created': '2017-01-30T01:33:20Z',
    'type': 'feedback',
    'id': 'iyjf8hcyvgo27c',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with this method of tackling a coding problem. Writing out notes about the coding process before you begin can make it easier to write the code, because you will already know exactly what you are needing to create code for. I also think that writing it out on paper allows you to make random notes and not be worried about having to write out precise Python comments yet. For those of us who have just started coding in CS 177, it can still seem a little daunting to have to only work out of the Python program! Using the paper as a different medium to work on the assignment away from the computer may make it a little easier to brainstorm ideas and allow yourself to make mistakes before figuring out the best way to begin coding.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:00:04Z',
    'uid': 'iy855p5hppx52l',
    'created': '2017-02-01T03:00:04Z',
    'type': 'feedback',
    'id': 'iymd7prpwav33q',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that thinking through the process step by step before googling is beneficial. This will allow yourself to see what you actually know and what you need to work on. To add onto your thought, I feel like actually writing out the step by step process could even better one&#39;s understanding as well as get closer to completing the process.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:59:08Z',
    'uid': 'isywpd8swql51l',
    'created': '2017-02-01T00:59:08Z',
    'type': 'feedback',
    'id': 'iym8w7e292p1ge',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree completely with everything you have to say. I especially want to emphasize the points where you stated &#34;Thinking logically is key!&#34; and &#34;By slowing down and tackling each step of the problem in a sequential order...&#34;. CS 177 is different than most courses in such a way that the answer is not always flat out given to you through a set method or use of formulas. You must read the book to understand concepts and then use his own knowledge and thinking style to actually produce the code. Also, slowing down and actually thinking about what you are telling a program to do is essential. Often times, it is easy to get frustrated and work quickly with Python, but slowing down and taking a step back is quite effective in succeeding in this course. Good post!</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T01:03:54Z',
    'uid': 'ijd40qe9l45sa',
    'created': '2017-02-01T01:03:54Z',
    'type': 'feedback',
    'id': 'iym92bqbue13h4',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I share the same experience! As a beginner I was terrified that this course requires massive tools to be succeeded. However my interest grows as I see the logic pattern in python is rigorous and attractive, which is the very reason that I decide to continue this course.You are also absolutely right that if you do everything step by step, homework and labs are not concerns at all. Your post is fantastic!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:58:46Z',
    'uid': 'hz5sohdcqvp5eh',
    'created': '2017-01-31T03:58:46Z',
    'type': 'feedback',
    'id': 'iykzvd0kc0323k',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Carson,\xa0</p>\n<p></p>\n<p>I agree with what you said, but I think I differ in my own challenges. Formatting is easy for me because I have a good understanding of the various keystrokes. It&#39;s the logic behind problems that gives me the hardest time. Once I figure that out, the execution is not as difficult.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:47:08Z',
    'uid': 'ib0viyx8gul',
    'created': '2017-01-31T20:47:08Z',
    'type': 'feedback',
    'id': 'iylzw4tnkpv3kw',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Great comment, by the way. However, if this course&#39;s purpose was to have students think logically, then what makes it different from a math class or chemistry class? This course shows the intricacies behind what makes a program run. If one piece of code is wrong, then the whole process either stops or doesn&#39;t give the right output. It&#39;s quite possibly true that a big portion of the class won&#39;t be using these skills again, but the things we have been doing are transferable programming skills. Through learning the programming language are students able to understand the broader ideas.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T00:20:53Z',
    'uid': 'isg5oeckTyx',
    'created': '2017-01-30T00:20:53Z',
    'type': 'feedback',
    'id': 'iyjcnb41kt9xn',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with making sure to comment everything. \xa0Personally, I am a very organized person and making comments help me to &#34;organize&#34; my code in the best way possible. It also helps me to put in the comments before I put in any code. \xa0That way I am able to take a step back and focus on what my overall goal of the particular code is. \xa0</p>\n<p>Also, trial and error was something that I did not expect coming into CS. \xa0I have quickly learned that no matter how correct I may think my code is, there is always something I need to tweak. \xa0So definitely get use to giving your code a try early on to see if you are heading in the right direction. \xa0 \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T02:35:34Z',
    'uid': 'hz5sohokg6c5f3',
    'created': '2017-01-30T02:35:34Z',
    'type': 'feedback',
    'id': 'iyjhgiqt6xr3eh',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with this. In a lot of other classes I&#39;m used to being taught concepts but with CS a lot of the learning is on your own and only comes for me when actually applying them. In addition, making sure you understand\xa0<em>why</em> each line of code should be there helps me understand what I am telling the computer to do and very literally.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-02T20:52:23Z',
    'uid': 'iy855te57db56c',
    'created': '2017-02-02T20:52:23Z',
    'type': 'feedback',
    'id': 'iyouykyae25552',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with your opinion. I always check my book when I was doing my homework because there are a lot of hint in the book.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T02:41:54Z',
    'uid': 'i0nar7iu6za1jt',
    'created': '2017-02-01T02:41:54Z',
    'type': 'feedback',
    'id': 'iymckcrqrus6m2',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree. Textbook is really helpful since it gives us the basic rules and knowledge that we need to follow and to learn. Also learning from our past failures can help us figure out something we do not know. Like before, I used tab and space for coding but from my assignment, I found out that we cannot use them both. So do not afraid to make mistakes!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T00:56:13Z',
    'uid': 'igcagrk76ji513',
    'created': '2017-01-30T00:56:13Z',
    'type': 'feedback',
    'id': 'iyjdwrb8m8b639',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with the homework part. The homework questions lead the way for one another sometimes. If you are stuck on one, the requirement in a later question might spark some ideas on how to do the previous one. The suggestions for an incorrect homework question also help a lot. Sometimes I type in the correct code by chance, so I always go back and see why it is correct. Having a working program is awesome!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T03:21:15Z',
    'uid': 'iy855urckhp5c3',
    'created': '2017-01-30T03:21:15Z',
    'type': 'feedback',
    'id': 'iyjj39tsqvj4mz',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with not waiting until the last minute. It can certainly raise your anxiety levels. It also makes you more prone to rush and just want to google things instead of taking the time to learn the how and why of the programming process! You definitely want to take your time that way you&#39;ll know it\xa0permanently.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T07:23:26Z',
    'uid': 'hzfsjux0w2c480',
    'created': '2017-01-31T07:23:26Z',
    'type': 'feedback',
    'id': 'iyl76k6kxe44ki',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I absolutely agree that we need to start working on assignments early because I uploaded my assignment 3 mins before the deadline last week, and I would never do that again. CS assignments will become more and more difficult, and may require more time on it, so we definitely need to start working on it way ahead of time. Besides, I find that reading the textbook before coding can be very helpful. Examples on the textbook are easy to understand, and they are usually related to homework.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T04:26:13Z',
    'uid': 'isuhh8e18ne2ce',
    'created': '2017-01-31T04:26:13Z',
    'type': 'feedback',
    'id': 'iyl0uns070554',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I like your approach here, I did not think of it that way. I mainly think of it as another math class because of the heavy use of math in this course. I try to think of them as math problems that need to be figured out and they only have one answer. If I think of it this way then I know that when I code I should always recheck what I have and make sure I did not switch a sign somewhere because I have moved too fast trying to get it done. I think we should all slow down when we are coding instead of rushing to get it dome so that we actually understand what we are learning. I have had trouble understanding the book so I have also found it helpful to ask on of the TAs to further explain it.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T16:38:39Z',
    'uid': 'hz5sohes5qc5ek',
    'created': '2017-01-30T16:38:39Z',
    'type': 'feedback',
    'id': 'iykbkqfnw9w2i2',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree with the method of repetition for this class. When we started this class, I found it difficult to write a simple code that would print something. Now that I have written that code several times, it comes easy to me. I also agree with the fact that we should be working through problems on our before receiving help from the TAs in lab. Getting help from them is much more beneficial when the student has some sort of starting point, as opposed to going to lab knowing nothing. I think that the most specific a question is, the TA is most likely to answer, as they know that we have already tried working out the code for ourselves several times before coming to lab.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T01:17:53Z',
    'uid': 'isf58c4mnhc5m8',
    'created': '2017-01-31T01:17:53Z',
    'type': 'feedback',
    'id': 'iyku4go7uka537',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I have to agree that\xa0the best course for completing assignments is to just <em>do</em> them. You&#39;re right - coding is a daunting, involved process that takes just as much learning as doing. A step-by-step process is key to unraveling a programming problem, and sometimes the direct approach is not always best, as experimentation and incremental trials can net you positive results.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:59:18Z',
    'uid': 'ijelfg6glkj4ad',
    'created': '2017-02-01T00:59:18Z',
    'type': 'feedback',
    'id': 'iym8wf82qje1np',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with your point about just doing the assignment. When you get stuck there are a ton of online resources that allow you to see what other people have done in similar situations.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T15:17:54Z',
    'uid': 'iy855toz4a56l',
    'created': '2017-01-30T15:17:54Z',
    'type': 'feedback',
    'id': 'iyk8ovxmkaz3eq',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree that you need to take breaks from programming if you are having a break. I think I was having trouble with the second prelab we had last week, and I noticed myself getting annoyed at python because I was stuck, so I decided to take a shower, and about 4 minutes into that shower, I realized what I was doing wrong. I wasn&#39;t even thinking about coding. The breaks really help if you get stuck or can&#39;t figure out what you are doing wrong with the code.</p>\n<p></p>\n<p>I would also say that if you don&#39;t have any errors, but still are not getting the correct answer, I would take a piece of paper and follow the variable step-by-step and see if the outcome is the one the program is giving you or the one you are supposed to get.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T04:21:52Z',
    'uid': 'ie4uvehwhDv',
    'created': '2017-01-30T04:21:52Z',
    'type': 'feedback',
    'id': 'iyjl97lv9jg6ri',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I really agree with what you&#39;re saying, this part has been tough for me too. I think what has helped me with teaching myself is making sure I start my work at least 4 days before it&#39;s due. This ensures I figure out what I don&#39;t understand early and have plenty of time to get help or find time to figure it out on my own.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T03:27:14Z',
    'uid': 'ixtctnlrmlq4dd',
    'created': '2017-01-30T03:27:14Z',
    'type': 'feedback',
    'id': 'iyjjaygr1a53fj',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree! This class is difficult and you&#39;ll feel like you are being defeated every week, but trying over and over is only helping you in the long run. \xa0I always need to tell myself to keep trying and not to give up. \xa0It&#39;s easier for me to remember that, when I remember that there are a lot of other people starting from the bottom, just like me. \xa0Patience really is a virtue in this class. \xa0I kind of wish I had taken this class earlier in my academic career because it has brought a new level of patience to my life. \xa0Also, trying is considered practice in this class. \xa0For every try you get wrong, it just means you are closer to getting it right and actually knowing why it is right.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T05:10:11Z',
    'uid': 'iy855vtd7kz5ik',
    'created': '2017-01-30T05:10:11Z',
    'type': 'feedback',
    'id': 'iyjmzck6ot44ru',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Yes, I heard that the class will be harder and harder with the semester going, however, being patient and never give up is very important. Use office hour, use group discussion, ask help from TA ... there is hundreds of ways to help us out!\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T22:24:43Z',
    'uid': 'i4su0oitfa04v5',
    'created': '2017-01-30T22:24:43Z',
    'type': 'feedback',
    'id': 'iyknxrr7uufnf',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree! Giving up will only fail you as a programmer. Not being able to solve things in CS can be frustrating, but if we continue to work hard and manage to solve it, that will be the most amazing feeling ever!</p>\n<p></p>\n<p>Always start early so that you have more chance to try and improve yourself!\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T03:53:11Z',
    'uid': 'h34uu8xdf7y69r',
    'created': '2017-01-30T03:53:11Z',
    'type': 'feedback',
    'id': 'iyjk8bskdig1da',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Interesting point of view that you &#34;aren&#39;t taught anything&#34; in lecture -- perhaps you meant that you need to be familiar with the concepts prior to lecture so you can learn to apply them to more realistic problems. ;0)</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T23:17:11Z',
    'uid': 'is8egvk8q7n6',
    'created': '2017-01-30T23:17:11Z',
    'type': 'feedback',
    'id': 'iykpt93saiw24j',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with you. When I did my first homework, I almost got\xa0upset because I\xa0could not understand\xa0the\xa0meaning\xa0of\xa0symbols\xa0and\xa0space. I spent many\xa0hours\xa0to figure it out, but\xa0it was\xa0valuable.\xa0Your\xa0saying, &#34;Everyone is struggling in their own way&#34;, really encourages me. Thank you.\xa0\xa0\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T07:13:06Z',
    'uid': 'iy855qyeiza53s',
    'created': '2017-01-30T07:13:06Z',
    'type': 'feedback',
    'id': 'iyjrdfofgzi4ua',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is helpful in identifying what is difficult to understand (so new students are aware), but I think it may be helpful if you also added what <em>exactly</em> helped you learn to code better. You mentioned using the textbook, but did you do exercises from the textbook or just read it? How did you experiment with your codes? Where did you turn if you were really, really lost? I think it may help someone who is looking for a bit more structured advice.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T04:14:25Z',
    'uid': 'ijbjp57g5de449',
    'created': '2017-02-01T04:14:25Z',
    'type': 'feedback',
    'id': 'iymfvca6mg73ah',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree that learning to write code is like learning a new language. And what is the best way to learn a new language? To speak it! Studying vocab words and phrases on note cards is valuable, but nothing makes it stick to your brain like actually speaking! The same applies to writing code. Lectures and the textbook are where you get introduced to new concepts, but they become skills you can apply without hesitation only through the crucible of practice. Professor Mcfall himself has said in class &#34;Practice makes permanent&#34;. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T04:58:07Z',
    'uid': 'is8t6k7g1u4gz',
    'created': '2017-01-30T04:58:07Z',
    'type': 'feedback',
    'id': 'iyjmjtxxfmr7an',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is really useful to a new commer because coding can actually be really taxing on a person. Breaking things down and fully understanding the reasons why something is happening is the way to fully accept and come to terms with things. The first time I ever looked at code, I was actually really surprised as to how things were working. I completely agree with plugging things into the code because that&#39;s what makes things click and come together. But, breaking things down, into their individual components is what actually helps you in the end, because you aren&#39;t actually writing things you don&#39;t understand, you are putting together multiple pieces that you do know.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T14:51:38Z',
    'uid': 'iy855rx4z9t54s',
    'created': '2017-01-30T14:51:38Z',
    'type': 'feedback',
    'id': 'iyk7r3rb94r8z',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I have to say that the biggest help for me is asking my roommate for assistance. He is an expert at coding and he explains the concepts of the problems I struggle with a lot better than the questions do. It may also prove helpful to write out or draw what you want your program to do. I found this very helpful with the pre-labs and programs I write to get practice with.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:54:07Z',
    'uid': 'iy855qsfult53n',
    'created': '2017-01-30T17:54:07Z',
    'type': 'feedback',
    'id': 'iyke9rn4cfy4j7',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with this advice. Originally, I would just jump into trying to write the program and I would often have many errors or have a program that didnt work properly. By outlining my code with comments before I started, it was much more clear what I had to do and it was easier to see what parts of my code served what function in the program.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T23:47:57Z',
    'uid': 'iy855r2hryk53v',
    'created': '2017-01-30T23:47:57Z',
    'type': 'feedback',
    'id': 'iykqwtewdfd76w',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think reading the book would help a lot. It explains some of the specifications that I believe you are struggling with from one language to another. I think it will help you pick up the syntax faster. The book does a good job at explaining different approaches as well. It has definitely been my most useful resource in the class so far.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T20:21:40Z',
    'uid': 'iy855opzkep529',
    'created': '2017-01-30T20:21:40Z',
    'type': 'feedback',
    'id': 'iykjjizmjni3ef',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I know small amounts of a few different languages, but I find I keep trying to type code with matlab language. It is a struggle at first, but I&#39;ve found that when I&#39;m really struggling, I can make a list of how to write the same thing in each language, so that I make a chart for myself. \xa0I don&#39;t know anything about C or C&#43;&#43;, but this might be a helpful idea for you as well.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T16:20:30Z',
    'uid': 'iy855tjxubo56g',
    'created': '2017-01-30T16:20:30Z',
    'type': 'feedback',
    'id': 'iykaxe5xfh71td',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that asking the TAs is very important. There has been many times where I was so close to figuring something out, and instead of just trying to put in random things until it came out right, I got to hear the logic of the TA. This helped me understand the program better and how it works so that I was not just trying to find a pattern, but being able to explain the program as well. I don&#39;t think anybody can actually be successful in this course without getting help from a TA, professor, or somebody with prior knowledge. That is, if they have had no prior experience with computer science or programming.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T14:52:06Z',
    'uid': 'h34uu8xdf7y69r',
    'created': '2017-01-30T14:52:06Z',
    'type': 'feedback',
    'id': 'iyk7rpj6ukmz',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Even in CodeLab, I find that spacing within strings (inside quotes) is very important but spacing between key words or Python commands is generally irrelevant. Try this out and see if it makes a difference ;0)</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T21:00:38Z',
    'uid': 'iecdce3ddw17bw',
    'created': '2017-01-30T21:00:38Z',
    'type': 'feedback',
    'id': 'iykkxmogw205j0',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think you bring up an interesting point that not a lot of people realize:\xa0that learning a foreign language is exactly like learning to code. And I believe your method of learning how to code allows for the user to not only find coding interesting but also learn more and better as they personally experience and develop skills that a book or online source cannot teach them. Although python is similar to the English language than other coding languages, the same sort of technical jargon and logic is used for pretty much all coding languages. Therefore, I think this trial and error method allows for the understanding and cementing of these technical aspects that can then be used for other coding languages.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:05:13Z',
    'uid': 'iy855ucypes57t',
    'created': '2017-01-30T17:05:13Z',
    'type': 'feedback',
    'id': 'iykciwatisl4i0',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with all that you have mentioned! I tend to find myself reading the problem over and over again to not only understand what it is asking me to do, but to try and break it down into simpler steps so that I am able to write a clear code. I have also had &#34;simple&#34; problems within my codes that bothered me, only to find out that I was just missing a parentheses, bracket, colon, etc. I believe it is only a matter of time before this becomes second nature to us, practice makes perfect!</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:28:25Z',
    'uid': 'iy855u6uizd571',
    'created': '2017-02-01T03:28:25Z',
    'type': 'feedback',
    'id': 'iyme86lkfo53to',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with that it is a fast pace course and we have to learn most of them by ourselves. Also, if you have problems finding the\xa0resource to study, go to the office hour, and then you can learn it in an efficient way. Similarly, the most exciting part for me is watching your code running after modifying hundreds of times, feeling the\xa0sense of achievement.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T17:57:50Z',
    'uid': 'ijelfh013uz4b5',
    'created': '2017-01-30T17:57:50Z',
    'type': 'feedback',
    'id': 'iykeeka2xid2t1',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with you. Some assignments take a fair amount of work so waiting to complete them until the last minute is never a good idea. They may take longer than you thought they would and this also limits your chance to get help. The labs do increase with difficulty and build off of each other, so I agree that you should stay on top of them.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T01:17:55Z',
    'uid': 'iy855qjzg9e53i',
    'created': '2017-01-31T01:17:55Z',
    'type': 'feedback',
    'id': 'iyku4i4m6kz5mh',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Hello Ryan,</p>\n<p></p>\n<p>I am in the very same boat as you. I have also had very little experience to CS as well. One thing that has helped me is to using other resources such as codeacademy.com. This has helped me better understand the basics of coding and concepts like &#34;for-loops&#34;. In addition, another valuable resource are other potential friends who already know how to code and who may be able to explain concepts to you. What has been helpful to me is the combination of these two as this allows me to get a different &#34;definition&#34;/idea of what &#34;for-loops&#34; are and get a better understanding of concepts.\xa0</p>\n<p></p>\n<p>Also I have been discouraged a lot as well from coding, sometimes it is helpful to walk away from the problem and come back to it with a fresh mind.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T18:00:47Z',
    'uid': 'iy855s13miv54x',
    'created': '2017-01-30T18:00:47Z',
    'type': 'feedback',
    'id': 'iykeicttiy656r',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>You are correct in saying not to give up. The solution is there in any number of ways, you just need to figure out what the nuances of that particular problem is. I will add to your statement in saying that it sometimes pays off to take a break from the problem. This obviously isn&#39;t possible in all situations but in the case of homeworks or pre-labs it is. I agree in your saying to avoid answers online. Not only will these answer potentially get you into trouble but they also will trick you into believing that you actually understand the problem when in reality you just understand their solution and if given a similar problem, you wouldn&#39;t be able to solve it on your own.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:20:55Z',
    'uid': 'iy855pnpday52x',
    'created': '2017-01-31T23:20:55Z',
    'type': 'feedback',
    'id': 'iym5dwga7gi6qu',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>The side project is a good idea! Do something catered to your studies and try to find a fix with python. Python has a plethora of uses, so using it for what you are studying/want to study is a great way to learn Python.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T22:02:58Z',
    'uid': 'iy855vallhh5hq',
    'created': '2017-01-30T22:02:58Z',
    'type': 'feedback',
    'id': 'iykn5sjvj5q6k4',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree with this! I found myself working on one of the pre-labs and had worked through most of it pretty quickly, but towards the end I could not get one of the loops to work for hours. Code is so touchy and until you get used to it, it is hard to pick out where such small errors are occurring. I went to bed and woke up the next morning and found it was something as simple as missing an extra parenthesis within the first couple minutes of looking at it. I would also recommend having someone else who knows the code look at it too.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T03:19:01Z',
    'uid': 'iy855sm9shn55m',
    'created': '2017-01-31T03:19:01Z',
    'type': 'feedback',
    'id': 'iykyg8wful27ba',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>i strongly agree with you. it is very common to meet a situation like that: think about a problem about an hour and coud not fix it, but if do it after a small break, you can easily come up with a method. since coding is really touchy, thinking all the time is not a good way and having a small break could sometimes be helpful</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T21:02:05Z',
    'uid': 'iaugrbcs2w24jm',
    'created': '2017-01-30T21:02:05Z',
    'type': 'feedback',
    'id': 'iykkzi8sgoa45l',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I have some prior programming experience and when I learned my first language, the logic really didn&#39;t come naturally to me.\xa0I think your point about some people requiring more time to fully grasp a concept is very true. The logic of programming is very difficult especially at the beginning and takes a lot of time for some to fully understand. For me doing hands on projects really helped me understand the logic. There were times that I would create a program and wouldn&#39;t fully understand how it works. However, through time and working on more complex projects I was able to master those\xa0initial programming skills and further understand the more complex skills as I learned about them.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-30T23:01:58Z',
    'uid': 'is718tsjcx05sk',
    'created': '2017-01-30T23:01:58Z',
    'type': 'feedback',
    'id': 'iykp9oik6ae3bm',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with planning out the logic of the code first rather than just trying to write code that solves the problem right away. I think it is also important to take the assignments step by step and work on the assignment in small sections at a time. I think the Lab Prep files do a good job at giving us small sections to do at a time. I also agree with the comments especially regarding the print statements, because this helps us find out what is being outputted at a certain line of code.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T06:26:32Z',
    'uid': 'i4uv9d6eeok4lt',
    'created': '2017-01-31T06:26:32Z',
    'type': 'feedback',
    'id': 'iyl55e8l8k2q8',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I strongly agree with your two advices. Asking questions and reading the textbook are so far what helped to get through the first three weeks. First of all, the reason a programming class has numerous TA&#39;s and available resources is that coding is hard and time taking, it is totally fine to have questions and to struggle for hours. TA&#39;s and professor are always there to guide and help us, all we need to do is ask. It is an interactive and quick way of learning, and there is nothing to be shame of, because everyone goes through this process. Furthermore, a textbook contains its author&#39;s (usually expert) lifelong wisdom and refined\xa0tips. Reading it allows\xa0us\xa0to stand on shoulders of giants so that we could see further. More importantly, practicing as many the problems in the textbook as possible is always going to better prepare us for our lectures, labs, and homework.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:24:39Z',
    'uid': 'if8n70zmf7I',
    'created': '2017-01-31T21:24:39Z',
    'type': 'feedback',
    'id': 'iym18dr270b91',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with your advice especially understanding the logic, it is one thing to complete the code and another thing to actually understand why the code works. The issue with not understanding the logic is that you will not be able to do a similar code in the future or using these logics as building blocks to the future. Understanding the logic is something i have been trying to force myself to do in this class so as to make it easier for me to succeed in assignments and in exams with the hope that i will be able to successfully program at the end of this class. I also agree with the help, there is a lot of help in this class and load of office hours I would definitely advice taking advantage of those.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T00:09:25Z',
    'uid': 'hku893kokxx6zq',
    'created': '2017-01-31T00:09:25Z',
    'type': 'feedback',
    'id': 'iykrof8mpfi4vo',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree the difficulty associated with breaking that habit of bulk memorization that has been customary in other science classes. I feel it helps when receiving help from the TA&#39;s to specifically ask them how does the computer process what you&#39;ve written and learning from these mistakes rather than just knowing how how a computer reads the correct answer. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T01:13:57Z',
    'uid': 'ijb0f0btmd31h4',
    'created': '2017-01-31T01:13:57Z',
    'type': 'feedback',
    'id': 'iyktzf0ak88617',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is a good piece of advice. In the first couple assignments, I found that I was wasting time because I was departing from the basics of the language and was making a lot of simple syntax errors. By referring to early chapters of the book often, you will learn how to write code more precisely and efficiently. It&#39;s easy to get wrapped up in writing code that&#39;s really complex, but usually the code\xa0is more simple than you might suspect at first.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:19:38Z',
    'uid': 'iy855svf5g255v',
    'created': '2017-01-31T21:19:38Z',
    'type': 'feedback',
    'id': 'iym11xciw23675',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I believe that building a strong foundation is key to learning any new language, whether it is a spoken language, or computer coding. \xa0If you start with a strong foundation, the following, more advanced topics won&#39;t seem as daunting of a task. \xa0You won&#39;t be able to move forward if you don&#39;t understand the simple, beginning topics. \xa0Like you said, using all of your resources is vital to being able to understand the beginning material, and also the more advanced material. \xa0I believe many students are afraid of admitting that they need help, but a lot of us have never even seen a computer code, so it is understandable that we would need help.</p>\n<p></p>\n<p>I also agree that programming is time consuming! I was shocked by how long the first prelab took me, but I wanted to make sure that I understood each and every part. \xa0However, taking that extra time actually made completing the lab in class very easy for me. \xa0I believe that the more time you give yourself to complete a task, the less frustrated you will become because I get stressed when I feel that\xa0I am under a time limit. \xa0When I allow myself excess time to complete something, I know that I will actually learn more than just trying to complete the assignment on time.</p>\n<p></p>\n<p></p>\n<p>I have never heard of StackOverflow, but a lot of students have posted about it, so I will have to look it up. \xa0I did, however, discover Code Academy, which provides excellent tutorials and problems for learning Python! \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T01:50:39Z',
    'uid': 'iy855v5r3tz5fz',
    'created': '2017-01-31T01:50:39Z',
    'type': 'feedback',
    'id': 'iykvalplgne1jk',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Attending and asking questions in lecture, lab, and recitation are also really important. Make friends in the class who can help you figure out what your code means and how to debug your code.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T04:06:00Z',
    'uid': 'hz5sohdcqvp5eh',
    'created': '2017-01-31T04:06:00Z',
    'type': 'feedback',
    'id': 'iyl04o55zbk6qj',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Chirag,</p>\n<p>I gotta admit...the feeling I get when my code works is unparalleled!\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T01:58:17Z',
    'uid': 'ik7lavghtgm74a',
    'created': '2017-01-31T01:58:17Z',
    'type': 'feedback',
    'id': 'iykvkf02n0c13',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I&#39;ve never heard of that app, is it free? I definitely could use some extra practice material and I think some additional sources besides the textbook could really help. Other than that, I agree with everything you&#39;ve said. I&#39;ve learned the hard way already not to do the assignments last minute. Making sure you have enough time to do the work and ask questions is, as I&#39;m learning, critical.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T02:01:18Z',
    'uid': 'iy855v5r3tz5fz',
    'created': '2017-01-31T02:01:18Z',
    'type': 'feedback',
    'id': 'iykvoajmy4l3ah',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Yes! The app is free. There&#39;s even a specific version just for Python. There are also ones for java, html,\xa0and other forms of coding!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T06:14:23Z',
    'uid': 'iy855ou4kq152d',
    'created': '2017-01-31T06:14:23Z',
    'type': 'feedback',
    'id': 'iyl4prgpcu1wy',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This sounds awesome! I will definitely\xa0try it out. Thanks for sharing!</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T01:13:14Z',
    'uid': 'i4sutr1x20h20',
    'created': '2017-02-01T01:13:14Z',
    'type': 'feedback',
    'id': 'iym9ebvx8545cs',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree, good habits can help you organize you codes, solve the problems efficiently.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T15:36:44Z',
    'uid': 'iy855ub22uf575',
    'created': '2017-01-31T15:36:44Z',
    'type': 'feedback',
    'id': 'iylosy2b137i',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree! The TAs are all really nice and respectful. Even if you&#39;re completely lost, they try their best to help you and don&#39;t treat you like you&#39;re stupid. People should never be afraid to ask them questions. I also love how there&#39;s unlimited tries and feedback on the homework, so you can figure out where you went wrong and fix it piece by piece without losing credit.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:14:55Z',
    'uid': 'iy855siixlk55i',
    'created': '2017-01-31T23:14:55Z',
    'type': 'feedback',
    'id': 'iym566kx61i17n',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with Rachel to use all your resources such as TAs, videos, and notes. I found watching videos is helpful as they type out the code and go step by step. Even if the code is not the same as your end goal, you can learn valuable functions and apply the parts you need to your code. I also liked Rachel&#39;s advice to practice using Python daily. I have found that practicing typing code while going through the book or during recitation is useful and allows me to adjust to Python format. It makes me feel overall more comfortable using Python, especially when it will come time for labs and exams.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T17:51:23Z',
    'uid': 'iy855qe9hca53e',
    'created': '2017-01-31T17:51:23Z',
    'type': 'feedback',
    'id': 'iyltm46o4t714y',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with this. Taking notes from the book is extremely helpful when trying to refer back to something you can&#39;t remember, such as how to use a specific command or the proper syntax for different elements. Trial and error is also super important, because every bit of code can be further optimized.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T16:25:35Z',
    'uid': 'iy855s4apl954z',
    'created': '2017-01-31T16:25:35Z',
    'type': 'feedback',
    'id': 'iylqjs3duuu4cu',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>This is perfect! I found this out by the first lab, that If I put the effort in to make sure my prelab runs smoothly, the actual lab assignment should be a breeze. I also wanted to point out the fact of spreading your work out into separate days (which you mentioned) works wonders. It does get frustrating when you cannot get the program to run the way you want it to, and sometimes taking a break can ease that frustration which may even make it easier to find the solution. \xa0\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T17:50:30Z',
    'uid': 'iwfpbzbr6984no',
    'created': '2017-01-31T17:50:30Z',
    'type': 'feedback',
    'id': 'iyltkyygxbi1sa',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I like the fact that we get unlimited tries on the homework as well. It&#39;s a good way of practicing concepts we have learned while not being penalized for trying and failing. Computer science is a much different science than most sciences that we learn, so it takes some time to get used to. But yes, reading the book and practicing with Python has definitely helped me master skills.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T15:17:59Z',
    'uid': 'iozz9g8rhr5212',
    'created': '2017-01-31T15:17:59Z',
    'type': 'feedback',
    'id': 'iylo4txz8e7ux',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with everything you have said! When the problem is thoroughly explained to me, I am able to better understand the reasoning behind each of the steps and\xa0remember them more clearly. I sometimes have a difficult time looking at the assignments and knowing exactly what to do right off the bat. It is helpful for me to remember that each problem is different and that I need to analyze each step needed to complete the problem.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T13:56:10Z',
    'uid': 'ijessi02li879f',
    'created': '2017-01-31T13:56:10Z',
    'type': 'feedback',
    'id': 'iyll7mhmfc251n',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with you said about the shortcomings of the beginning of class... It <em>is</em> really difficult to jump right into the coursework based on what we learn in the first few weeks of class and the textbook.\xa0 I also agree that the internet has taught me way more about programming thus far than the textbook or lectures. New students should really be taught about all of the online coding resources. Great advice for a new student, Jingyu!</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T06:13:25Z',
    'uid': 'iy855ou4kq152d',
    'created': '2017-01-31T06:13:25Z',
    'type': 'feedback',
    'id': 'iyl4oinjbgl4hm',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I totally agree with you! Knowing the basics of python helped me tremendously in this class. It is very important that you are familiar with the syntax the thought process of the computer--pure logic and step by step.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T15:52:22Z',
    'uid': 'iy855r8irdq541',
    'created': '2017-01-31T15:52:22Z',
    'type': 'feedback',
    'id': 'iylpd24nwqv38b',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Another thing is to make sure you&#39;re asking questions. A lot of this stuff, at least for me, can only be explained through application (lab time is probably where I do most of my learning). The TA&#39;s are a godsend and are pretty good at explaining the lab&#39;s in a a way where they are not just giving you the answer and you still have to figure it out on your own.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T15:39:15Z',
    'uid': 'iy855tg51nf56e',
    'created': '2017-01-31T15:39:15Z',
    'type': 'feedback',
    'id': 'iylow6x3phg1l8',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think this makes a good point: for loops are going to be very important this semester, so focusing on them is really helpful.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:10:04Z',
    'uid': 'iy855uvuy7e5da',
    'created': '2017-01-31T21:10:04Z',
    'type': 'feedback',
    'id': 'iym0pmpa5g32fa',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that loops are really important. I also agree that they can be extremely tricky if you are not completely aware of how they work.</p>\n<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:11:05Z',
    'uid': 'iy855uvuy7e5da',
    'created': '2017-01-31T21:11:05Z',
    'type': 'feedback',
    'id': 'iym0qxm3wx6ve',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think this makes a really good point. As we talked about in lecture, just going through what the code is supposed to do, especially loops, can help you understand what you might be missing in your code.</p>\n<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T22:38:51Z',
    'uid': 'iss9v0mmbkn71n',
    'created': '2017-01-31T22:38:51Z',
    'type': 'feedback',
    'id': 'iym3vsi4qdn3km',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with starting early on the assignments. You are less stressed, which may help you think through the coding process. Also, it gives you time to figure out what questions you are having trouble with so you can go on piazza and ask or go to office hours for help.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:38:59Z',
    'uid': 'itdegkreedi2p3',
    'created': '2017-02-01T00:38:59Z',
    'type': 'feedback',
    'id': 'iym86ag4b6fjj',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with returning to the trouble later and don&#39;t stuck at there, so that I can view the problem from a new aspect. I had a lot experiments of this when I was doing math.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:12:48Z',
    'uid': 'iy855uvuy7e5da',
    'created': '2017-01-31T21:12:48Z',
    'type': 'feedback',
    'id': 'iym0t54on5q6ew',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>The book also has a lot of examples which can help you to understand the material. Although they wont be exactly what you are doing in the homework, they are still invaluable.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:14:03Z',
    'uid': 'iy855uvuy7e5da',
    'created': '2017-01-31T21:14:03Z',
    'type': 'feedback',
    'id': 'iym0uqodlk164m',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree with this. Although I have personally found a lot of use for the book, especially when trying to understand basic code language, using online resources have helped me immensely through additional examples and explanation.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T17:01:12Z',
    'uid': 'hkkab4mn26k62c',
    'created': '2017-01-31T17:01:12Z',
    'type': 'feedback',
    'id': 'iylrtl4vtj62mp',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I can appreciate this advice a lot. I have actually previously taken this course and did not do very well. Ever since the professor touched on taking this approach to code, I have seemed to have a whole different understanding of what I am actually accomplishing, and I am doing significantly better in the course. I wish I would have known this sooner so I commend you for giving this advice to a new student.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T17:23:46Z',
    'uid': 'ijaaad3hUVl',
    'created': '2017-01-31T17:23:46Z',
    'type': 'feedback',
    'id': 'iylsml9fqif5hv',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think this is great advice. \xa0It&#39;s vital to master each step because those steps get added to the further you get in your coding education. \xa0Failing to learn one step may make it more difficult to master the skills to come.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:30:49Z',
    'uid': 'hsz0y0o3ud13r',
    'created': '2017-01-31T20:30:49Z',
    'type': 'feedback',
    'id': 'iylzb59k5y96ie',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>Hey friend!!! I want to expand this idea a little more. Some people might get so frustrated and angry when he/she cannot figure something out. Anyhow, when I cannot get through certain step, (e.g. for loop) I would take a break, not give it up, for a while. Do not let frustration get to you, work on something else, but not CS. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:07:46Z',
    'uid': 'iy855pqnmje532',
    'created': '2017-01-31T23:07:46Z',
    'type': 'feedback',
    'id': 'iym4wzc72s24pv',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': 'I would definitely agree that using the book is a great resource! At first the book appeared a bit technical and dense but after a couple of lectures and labs, the book began to make more sense.\xa0'
  },
  {
    'folders': [],
    'updated': '2017-01-31T20:32:17Z',
    'uid': 'is8t6hmlkikfq',
    'created': '2017-01-31T20:32:17Z',
    'type': 'feedback',
    'id': 'iylzd1ast6n28y',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree, the labs are a great way to complete assignments with the teaching assistants ready to offer quick help. It takes out some of the trial and error process which is normally discouraging when completing the other assignments. The loops are very tricky but the book offers a concise explanation of their properties and uses which I found helpful when working on some of the recent assignments!</p>\n<p></p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:15:40Z',
    'uid': 'iy855r9zug0543',
    'created': '2017-01-31T21:15:40Z',
    'type': 'feedback',
    'id': 'iym0wth99tp1e1',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<span style="background-color:#fff">Hey, I strongly agree with your idea that we need to be patient and persistent with the assignments, especially in the beginning of the semester. And also, being patient means you need to pay more attention to the details. Because in my personal experience, sometimes, you have a right logic and you know how to solve the problem, but if you don&#39;t pay attention to the details, your code won&#39;t work. Therefore, it&#39;s very essential for a beginner to be patient and persistent when trying to make the code work.</span>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T22:54:26Z',
    'uid': 'iy855tv9zzi56t',
    'created': '2017-01-31T22:54:26Z',
    'type': 'feedback',
    'id': 'iym4fufxbd42q6',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I cannot agree with you more. Patience and persistence is key. I learned that the hard way for the first assignment. Granted it was straight forward but when I looked at it the first time, it definitely discouraged me. But like you said, good thing I started to attempt the homework early which gave me a lot of time to go through the book.</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T23:14:53Z',
    'uid': 'iaugrdpkf104ky',
    'created': '2017-01-31T23:14:53Z',
    'type': 'feedback',
    'id': 'iym564ncech13r',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree in terms of reading the book; at first, I didn&#39;t think that learning aspects of a subject where you had to physically code something would be better learnt from a book, but our book does a great job explaining why each part of the coding should be written a certain way, and even cites which section the material was reviewed in at times. Reading defines the basics and helps those that are completely lost, as I was, and am sure still will be at times.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-01-31T21:10:57Z',
    'uid': 'idtlew4q31r2ms',
    'created': '2017-01-31T21:10:57Z',
    'type': 'feedback',
    'id': 'iym0qr00fzb4qa',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely agree on that note. Doing the assignments last minute is asking for disaster.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:27:14Z',
    'uid': 'itdegkreedi2p3',
    'created': '2017-02-01T00:27:14Z',
    'type': 'feedback',
    'id': 'iym7r6713dn252',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree. The earlier we read the book, the more practice we can do.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T02:33:16Z',
    'uid': 'isuhhdzy5c82ic',
    'created': '2017-02-01T02:33:16Z',
    'type': 'feedback',
    'id': 'iymc99r345y400',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with this. Although some of the inputs into your code may work others won&#39;t. You can create different codes with the same functions and sometimes one way is better than another. At first I tried to use an education to calculate the sum in our last lab and it worked for some of the numbers however it didn&#39;t work for others. Then I tried a new approach by adding to my for loop and this worked will inputs. This is great advice!</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:37:33Z',
    'uid': 'hkju0r89iun19h',
    'created': '2017-02-01T00:37:33Z',
    'type': 'feedback',
    'id': 'iym84g38u5ai6',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>The &#34;go-to sheet&#34; you have compiled so far is such a great idea! I wish I thought of that freshman year when learning java. What a great tool that is now, but in the future it will also be great to have. Thanks for the advice.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:51:29Z',
    'uid': 'ids7rsjvGPq',
    'created': '2017-02-01T03:51:29Z',
    'type': 'feedback',
    'id': 'iymf1ujmbxrei',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree with what you said in your first point! I found that if I run the program and find out how the code I have written looks first, it helps me to go back and then make necessary edits to achieve the main goal. I have found also that there was a sense of accomplishment when I am able to figure it out by using this method of attempt and edit.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:11:45Z',
    'uid': 'ixqppdfp8k06p1',
    'created': '2017-02-01T00:11:45Z',
    'type': 'feedback',
    'id': 'iym779jajvn4kh',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I think you are right. Sometimes, I have to spend hours to debug a single program. I had too many chance to just say give up, however, I like to spent time on challenging the coding, its really fun. \xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T00:37:00Z',
    'uid': 'iy855so0d0v55o',
    'created': '2017-02-01T00:37:00Z',
    'type': 'feedback',
    'id': 'iym83qh5qnk2ws',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I wholeheartedly agree with the sentiment of reading the textbook. Often times I&#39;ll find myself stuck on an assignment that could&#39;ve been done simply by looking at the assigned reading. After reading the text and understanding the new concepts presented, the assignments in class and on CodeLab are a breeze.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T02:12:35Z',
    'uid': 'iy855v7dr335gn',
    'created': '2017-02-01T02:12:35Z',
    'type': 'feedback',
    'id': 'iymbio5wib31dp',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I definitely found this very helpful in my work. When first starting this class I came in completely cold, never having programmed even a little bit so messing around and practicing with how to do each little thing helped me a lot.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:59:10Z',
    'uid': 'ijj2mkphtcrmq',
    'created': '2017-02-01T03:59:10Z',
    'type': 'feedback',
    'id': 'iymfbqcrvfx7fd',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree a lot with your sentiments. I too, am a math major, and similarly, I look at CS in a very mathematical away. Sometimes it can be helpful, because CS is based off logic. However, sometimes things do not follow in a very mathematical way. I agree that careful reading of the book can really help clear up issues.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T02:53:49Z',
    'uid': 'iy855t6jqui562',
    'created': '2017-02-01T02:53:49Z',
    'type': 'feedback',
    'id': 'iymczol3l343ou',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that practice is key. One thing I still struggle with is knowing what questions to ask. I know what i want to do just not how to get there. Like you said laying out your process can really help with that.\xa0</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T03:45:25Z',
    'uid': 'iy855uisvsd59i',
    'created': '2017-02-01T03:45:25Z',
    'type': 'feedback',
    'id': 'iymeu1mml4l5q1',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I agree that slow and steady wins the race. You need to think through the problem first and then start your code once you understand the problem and what the lab is asking you to do.</p>'
  },
  {
    'folders': [],
    'updated': '2017-02-01T04:07:30Z',
    'uid': 'iy855q1594b536',
    'created': '2017-02-01T04:07:30Z',
    'type': 'feedback',
    'id': 'iymfmg5wca45uy',
    'anon': 'no',
    'bucket_name': 'Week 1/29 - 2/4',
    'config': {},
    'bucket_order': 7,
    'data': None,
    'children': [],
    'subject': '<p>I completely agree that finding someone who is familiar with Python is important! They are typically much more readily available than TA&#39;s and they can be easier to talk to. I, personally, enjoy the book as a resource. I believe that it has a lot of helpful examples and tips that can be beneficial to understanding prelabs and labs. Despite this, the book can be hard to navigate, wordy, and dense.</p>'
  }
]
